In [1]:
import numpy as np
import pandas as pd
import os
import seaborn as sns

In [2]:
os.getcwd()

'C:\\Users\\Dell\\Desktop\\MDS'

In [3]:
os.chdir("C:\\Users\\Dell\\Desktop\\MDS\\New folder\\PANDAS READ DATA\\PANDAS READ FILE WITH  DATA")

In [4]:
data=pd.read_json("employee_data.json")
data['features']

0      {'candidate': {'first_name': 'Margaret', 'last...
1      {'candidate': {'first_name': 'Michael', 'last_...
2      {'candidate': {'first_name': 'Brenda', 'last_n...
3      {'candidate': {'first_name': 'Joseph', 'last_n...
4      {'candidate': {'first_name': 'Laura', 'last_na...
                             ...
495    {'candidate': {'first_name': 'Robert', 'last_n...
496    {'candidate': {'first_name': 'Lucas', 'last_na...
497    {'candidate': {'first_name': 'Kimberly', 'last...
498    {'candidate': {'first_name': 'Karla', 'last_na...
499    {'candidate': {'first_name': 'Mrs.', 'last_nam...
Name: features, Length: 500, dtype: object

In [5]:
l=[v1['candidate'] for v1 in data['features']]
data1=pd.DataFrame(l)

In [6]:
data1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   first_name  500 non-null    object
 1   last_name   500 non-null    object
 2   skills      500 non-null    object
 3   state       500 non-null    object
 4   specialty   500 non-null    object
 5   experience  500 non-null    object
 6   relocation  500 non-null    object
dtypes: object(7)
memory usage: 27.5+ KB

In [7]:
data1.describe()

       first_name last_name   skills state specialty experience relocation
count         500       500      500   500       500        500        500
unique        243       308      428    50         4          3          3
top       Michael     Jones  [Spark]    MO  Database        Mid         no
freq           16        10       11    17       137        179        172

In [8]:
data1.sort_values('experience')

,first_name,last_name,skills,state,specialty,experience,relocation
249,Amy,Campbell,[C++],MO,Database,Junior,yes
141,Michael,Rice,"[Python, TensorFlow, Java, MongoDB]",MD,Data Visualization,Junior,no
142,Bradley,Howard,"[C++, MongoDB]",OR,Machine Learning,Junior,no
143,Tyler,Lee,"[Spark, Java]",MO,Statistics,Junior,yes
145,Sandra,Ford,"[C++, Spark]",MI,Statistics,Junior,maybe
...,...,...,...,...,...,...,...
133,Kevin,Murphy,"[Java, C++, TensorFlow, Spark, skLearn]",UT,Database,Senior,yes
131,Olivia,Thomas,"[Python, C++]",ME,Database,Senior,maybe
355,Aaron,Williams,"[MongoDB, TensorFlow, Python]",MS,Database,Senior,yes
357,Lindsey,Colon,"[SQL, R, MongoDB, skLearn, Python, Java, C++, ...",WI,Statistics,Senior,maybe
499,Mrs.,Debra,"[skLearn, R, MongoDB, Spark, TensorFlow, Java,...",TX,Statistics,Senior,no

What experience levels do employees have?

In [9]:
data1['experience'].unique()

array(['Mid', 'Senior', 'Junior'], dtype=object)

How many employees have mid-level experience?

In [10]:
data1[data1['experience']=='Mid'].shape[0]

179

How many employees have Senior-level experience?

In [11]:
data1[data1['experience']=='Senior'].shape[0]

163

How many employees have Junior-level experience?

In [12]:
data1[data1['experience']=='Junior'].shape[0]

158

In [13]:
data1.sort_values('specialty')

,first_name,last_name,skills,state,specialty,experience,relocation
102,Theresa,Martinez,"[Python, SQL, MongoDB, C++, TensorFlow, skLearn]",WI,Data Visualization,Senior,yes
352,Glenn,Stewart,"[TensorFlow, Java, Spark, SQL, R, skLearn, Mon...",NC,Data Visualization,Mid,no
112,Jennifer,Stewart,"[Python, Java, skLearn, R, Spark]",CA,Data Visualization,Senior,maybe
344,Nancy,Morton,"[Spark, Python, SQL, Java, skLearn, MongoDB, T...",MS,Data Visualization,Junior,yes
337,Steven,Allen,"[Java, Spark]",NH,Data Visualization,Junior,no
...,...,...,...,...,...,...,...
353,Theresa,Brown,"[skLearn, C++]",OH,Statistics,Mid,no
354,Alyssa,Sandoval,"[MongoDB, R, skLearn, Python]",OK,Statistics,Junior,no
110,Sarah,Porter,"[MongoDB, Python, skLearn, SQL, Java, TensorFlow]",KY,Statistics,Senior,yes
109,Jacqueline,Spencer,"[Java, Python, skLearn, R, MongoDB, C++, SQL, ...",ME,Statistics,Mid,no
499,Mrs.,Debra,"[skLearn, R, MongoDB, Spark, TensorFlow, Java,...",TX,Statistics,Senior,no

In [14]:
data1['specialty'].unique()

array(['Database', 'Statistics', 'Machine Learning', 'Data Visualization'],
      dtype=object)

How many employees have specialized in databases?

In [15]:
data1[data1['specialty']=='Database'].shape[0]

137

How many employees have specialized in statistics?

In [16]:
data1[data1['specialty']=='Statistics'].shape[0]

133

How many employees have specialized in machine learning?

In [17]:
data1[data1['specialty']=='Machine Learning'].shape[0]

114

How many employees have specialized in data visualization?

In [18]:
data1[data1['specialty']=='Data Visualization'].shape[0]

116

In [19]:
data1.sort_values('relocation')

,first_name,last_name,skills,state,specialty,experience,relocation
127,Donald,Jefferson,"[C++, SQL, skLearn, Python, MongoDB, Spark]",MT,Machine Learning,Mid,maybe
147,Shawn,James,"[R, Python]",LA,Machine Learning,Mid,maybe
359,Nicole,Lewis,"[Spark, Python, TensorFlow, C++, SQL]",AZ,Statistics,Junior,maybe
149,Elizabeth,Prince,[TensorFlow],ID,Database,Junior,maybe
357,Lindsey,Colon,"[SQL, R, MongoDB, skLearn, Python, Java, C++, ...",WI,Statistics,Senior,maybe
...,...,...,...,...,...,...,...
150,Nicholas,Bruce,"[R, Spark]",ND,Data Visualization,Mid,yes
358,John,Schneider,"[MongoDB, TensorFlow, C++, R, skLearn]",HI,Database,Mid,yes
143,Tyler,Lee,"[Spark, Java]",MO,Statistics,Junior,yes
182,Ashley,Smith,"[C++, Spark, R, Java, MongoDB, Python, skLearn...",NM,Database,Senior,yes
249,Amy,Campbell,[C++],MO,Database,Junior,yes

In [20]:
data1['relocation'].unique()

array(['no', 'yes', 'maybe'], dtype=object)

How many employees are willing to relocate?

In [21]:
data1[data1['relocation']=='yes'].shape[0]

163

How many employees are not willing to relocate?

In [22]:
data1[data1['relocation']=='no'].shape[0]

172

How many employees are not sure about their decision of relocating yet?

In [23]:
data1[data1['relocation']=='maybe'].shape[0]

165

In [24]:
data1['S.no.']=list(range(500))

In [25]:
skill_id=[]
for i in range(500):
    skill_id.append(pd.DataFrame(data['features'][i]['candidate']).shape[0])
indices=[i for i in range(len(skill_id)) if skill_id[i]==9 ]

In [26]:
set(skill_id)

{1, 2, 3, 4, 5, 6, 7, 8, 9}

How many employees have all desired skills?

In [27]:
mostskilled=data1.iloc[indices]
mostskilled.shape[0]

52

How many employees have all desired skills with mid experience level?

In [28]:
mostskilled[mostskilled['experience']=='Mid'].shape[0]

24

How many employees have all desired skills with senior experience level?

In [29]:
mostskilled[mostskilled['experience']=='Senior'].shape[0]

16

How many employees have all desired skills with junior experience level?

In [30]:
mostskilled[mostskilled['experience']=='Junior'].shape[0]

12

How many employees have all desired skills with specialization in databases?

In [31]:
mostskilled[mostskilled['specialty']=='Database'].shape[0]

8

How many employees have all desired skills with specialization in machine learning?

In [32]:
mostskilled[mostskilled['specialty']=='Machine Learning'].shape[0]

10

How many employees have all desired skills with specialization in data visualization?

In [33]:
mostskilled[mostskilled['specialty']=='Data Visualization'].shape[0]

17

How many employees have all desired skills with specialization in statistics?

In [34]:
mostskilled[mostskilled['specialty']=='Statistics'].shape[0]

17

In [35]:
a=pd.DataFrame()
for i in range(0,500):
    a=pd.DataFrame.append(a,pd.DataFrame(data['features'][i]['candidate']),ignore_index=True)

In [36]:
a.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2468 entries, 0 to 2467
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   first_name  2468 non-null   object
 1   last_name   2468 non-null   object
 2   skills      2468 non-null   object
 3   state       2468 non-null   object
 4   specialty   2468 non-null   object
 5   experience  2468 non-null   object
 6   relocation  2468 non-null   object
dtypes: object(7)
memory usage: 135.1+ KB

In [37]:
a.describe()

       first_name last_name skills state specialty experience relocation
count        2468      2468   2468  2468      2468       2468       2468
unique        243       308      9    50         4          3          3
top       Michael     Jones  Spark    AL  Database        Mid         no
freq           90        57    285    78       644        904        856

In [38]:
a['skills'].unique()

array(['skLearn', 'Java', 'R', 'SQL', 'Spark', 'C++', 'TensorFlow',
       'MongoDB', 'Python'], dtype=object)

How many employees know skLearn ?

In [39]:
a[a['skills']=='skLearn'].shape[0]

267

How many employees know Java ?

In [40]:
a[a['skills']=='Java'].shape[0]

267

How many employees know R ?

In [41]:
a[a['skills']=='R'].shape[0]

272

How many employees know SQL ?

In [42]:
a[a['skills']=='SQL'].shape[0]

277

How many employees know Spark ?

In [43]:
a[a['skills']=='Spark'].shape[0]

285

How many employees know C++ ?

In [44]:
a[a['skills']=='C++'].shape[0]

274

How many employees know TenserFlow ?

In [45]:
a[a['skills']=='TensorFlow'].shape[0]

280

How many employees know MongoDB ?

In [46]:
a[a['skills']=='MongoDB'].shape[0]

274

How many employees know Python ?

In [47]:
a[a['skills']=='Python'].shape[0]

272

How to sort data alphabetically in order of employee's first name?

In [48]:
sorted_alphabetically=data1.sort_values('first_name')

In [49]:
data1['state'].unique()

array(['AL', 'AR', 'UT', 'FL', 'WY', 'OK', 'NM', 'TX', 'WI', 'PA', 'NV',
       'MO', 'ID', 'KY', 'NE', 'WV', 'NC', 'TN', 'CT', 'IN', 'ND', 'HI',
       'NJ', 'GA', 'CO', 'LA', 'AK', 'SD', 'MA', 'MT', 'SC', 'NY', 'DE',
       'IL', 'AZ', 'IA', 'WA', 'VA', 'RI', 'MD', 'CA', 'OR', 'ME', 'OH',
       'KS', 'MN', 'MI', 'MS', 'NH', 'VT'], dtype=object)

Number of employees from each state

In [50]:
k=[]
for i in data1['state'].unique():
    for j in data1['state']:
        if i==j:
                k.append(j)
for i in data1['state'].unique():
    print(i,k.count(i))

AL 12
AR 8
UT 9
FL 11
WY 11
OK 14
NM 15
TX 10
WI 12
PA 9
NV 11
MO 17
ID 11
KY 7
NE 12
WV 11
NC 11
TN 7
CT 14
IN 7
ND 10
HI 10
NJ 7
GA 13
CO 10
LA 11
AK 10
SD 3
MA 12
MT 13
SC 10
NY 10
DE 8
IL 10
AZ 8
IA 12
WA 11
VA 5
RI 8
MD 9
CA 11
OR 13
ME 8
OH 9
KS 10
MN 13
MI 9
MS 10
NH 6
VT 2